import telebot
from telebot import types

TOKEN = "8255205522:AAGUqhhiaH8-4CBl-H4W8GgcQupTb44Grio"
bot = telebot.TeleBot(TOKEN)


QUESTIONS = {
    "легкий": [
        (
            "Столица Казахстана?",
            ["Астана", "Алматы", "Шымкент"],
            0,
            "Астана стала столицей в 1997 году"),
        (
            "Национальный напиток?",
            ["Айран", "Чай", "Кумыс"],
            2,
            "Кумыс - тесно связан с кочевной культурой"),
        (
            "Казахстан — это?",
            ["Содружество", "Государство", "Федерация"],
            1,
            "Казахстан признан государством так как обладает всеми его ключевыми признаками"),
        (
            "Год независимости?",
            ["1991", "1989", "2000"],
            0,
            "именно 16 декабря 1991 года Верховный Совет Казахской ССР принял закон о независимости"),
        (
            "Нац. инструмент?",
            ["Домбра", "Гитара", "Скрипка"],
            0,
            "Домбра - древнейшее наследие и дуща народа."),
        (
            "Официальный язык?",
            ["Русский", "Казахский", "Английский"],
            1,
            "Он является языком титульной нации"),
        (
            "Национальная валюта?",
            ["Рубль", "Доллар", "Тенге"],
            2,
            "Национальная валюта называется тенге потому что это историческое тюркское слово, в переводе таньга-деньги"),
        (
            "Главная река?",
            ["Иртыш", "Нил", "Амазонка"],
            0,
            "Иртыш - самая длинная река протекающая по территории Казахстана"),
        (
            "Птица на флаге?",
            ["Воробей", "Беркут", "Орел"],
            1,
            "Он символизирует независимость, мудрость и свободу"),
        (
            "Какое море есть в Казахстане?",
            ["Красное", "Балтийское", "Каспийское"],
            2,
        "Каспийское море - единственное на территории Казахстана"),
    ],

    "средний": [
        (
            "Автор романа Путь Абая?",
            ["Кунанбаев", "Ауэзов", "Сейфуллин"],
            1,
            "Ауэзов написал  эту эпопею потому что он хотел увеоквечить творчество Абая"),
        ("Орда Абылая",
         ["Средний жуз", "Младший жуз", "Старший жуз"],
         0,
         "Орда Абылая исторически и географически была тесно связанна со Средним жузом, занимая его центральные территории"),
        ("Степь — это?", ["Равнина", "Горы", "Лес"], 0),
        (
            "Ханство основано в?",
            ["1465", "1500", "1400"],
            0,
            "султаны Керей и Жанибек, недовльные властью хана Абулхаира, во главе своих племен"),
        ("Юрта — это?", ["Дом", "Одежда", "Еда"], 0,),
        (
            "День конституции?",
            ["16 декабря", "22 марта", "30 августа"],
            2,
        "Именно 30 августа 1995 года, была принята действующая Конституция Республики Казахстан"),
        (
            "Духовный центр?",
            ["Астана", "Туркестан", "Актобе"],
            1,
            "Он является священным для тюркского мира, местом упокоения великого суфия Ходжи Ахмеда Ясави"),
        ("Автор «Слов назидания»?", ["Жабаев", "Жумабаев", "Абай"], 2),
        ("Город на Шёлковом пути?", ["Отрар", "Рим", "Москва"], 0),
        (
            "Бешбармак готовят из?",
            ["Мясо и тесто", "Рис", "Овощи"],
            0,
            "Бешпармак готовится из мяса, и теста. Подается с крепким бульоном, и в некоторых случаях с овощами"),
    ],

    "сложный": [
        (
            "Первый хан?",
            ["Керей", "Абылай", "Касым"],
            0,
            "Керей и Жанибек, будучи потомками чингизидов создали военную силу и провазгласили создание своего гос-ва"),
        (
            "Жеты жаргы — это?",
            ["Законы", "Песни", "Города"],
            0,
            "Жеты жаргы свод законов прнятых ханом Тауке"),
        (
            "Тюркский каганат?",
            ["VI век", "X век", "III век"],
            0),
        (
            "Алаш Орда?",
            ["Автономия", "Город", "Род"],
            0,
            "Алаш орда самоуправляемое государственное образование, которое стремилось к национально-территориальной автономии"),
        ("Томирис победила?",
            ["Кира", "Дария", "Аттилу"],
            0,
            "Томирис победила Кира в битве на его северной границе в 5 веке до нашей эры"),
        (
            "Основание ханства?", ["1465", "1456", "1501"], 0),
        ("Основатели ханства?",
         ["Керей и Жанибек", "Абылай", "Касым"], 0),
        ("Жеты жаргы принят при?",
         ["Тауке хан", "Есим хан", "Абылай хан"], 0),
        ("Восстание 1837–1847?",
         ["Кенесары", "Сырым", "Исатай"], 0),
        ("Столица при Тауке хане?",
         ["Туркестан", "Сузак", "Сыгнак"], 0),
    ]
}

state = {}
stats = {}
user_name = {}




@bot.message_handler(commands=['start'])
def start(message):
    kb = types.ReplyKeyboardMarkup(resize_keyboard=True)
    kb.add("об игре", "начать викторину", "моя статистика")
    bot.send_message(
        message.chat.id,
        "Здравствуйте! Это - развлекательная викторина с вопросами по казахской истории и культуре. Хорошей игры!\n" "команда 46 - phantasm", reply_markup=kb)




@bot.message_handler(func=lambda m: True)
def menu(message):
    cid = message.chat.id
    text = message.text

    if text == "начать викторину":
        if cid not in user_name:
            bot.send_message(cid, "Введите имя:")
            bot.register_next_step_handler(message, register)
        else:
            choose_level(message)

    elif text in ["легкий", "средний", "сложный"]:
        if cid not in stats:
            stats[cid] = {"right": 0, "wrong": 0}

        state[cid] = {
            "lvl": text,
            "i": 0,
            "answers": [],
            "right": 0,
            "wrong": 0
        }

        ask_question(message)

    elif text == "моя статистика":
        if cid in stats:
            bot.send_message(
                cid,
                f"📊 Ваша статистика за всё время:\n"
                f"Правильных: {stats[cid]['right']}\n"
                f"Неправильных: {stats[cid]['wrong']}"
            )
        else:
            bot.send_message(cid, "Вы ещё не проходили викторину.")

    elif text == "об игре":
        bot.send_message(cid, "kazakh_travel - это увлекательная викторина основанная на казахсткой культуре и истории! Викторина подойдет как и для проверки своих знаний, так и для того чтобы узнать что то новое.")

    elif cid in state:
        check_answer(message)




def register(message):
    user_name[message.chat.id] = message.text
    bot.send_message(
        message.chat.id,
        f"Успешная регистрация! Ваше имя пользователя: {message.text}"
    )
    choose_level(message)



def choose_level(message):
    kb = types.ReplyKeyboardMarkup(resize_keyboard=True)
    kb.add("легкий", "средний", "сложный")
    bot.send_message(
        message.chat.id,
        "Выберите уровень сложности:",
        reply_markup=kb
    )



def ask_question(message):
    cid = message.chat.id
    s = state[cid]

    q, opts, _, _ = QUESTIONS[s["lvl"]][s["i"]]

    kb = types.ReplyKeyboardMarkup(resize_keyboard=True)
    for o in opts:
        kb.add(o)

    bot.send_message(cid, q, reply_markup=kb)




def check_answer(message):
    cid = message.chat.id
    s = state[cid]

    item = QUESTIONS[s["lvl"]][s["i"]]

    q = item[0]
    opts = item[1]
    correct = item[2]
    explanation = item[3] if len(item) > 3 else None  # ← ВАЖНО

    user_answer = message.text
    correct_answer = opts[correct]

    is_correct = correct_answer == user_answer

    s["answers"].append(
        (q, user_answer, correct_answer, explanation, is_correct)
    )

    if is_correct:
        s["right"] += 1
        stats[cid]["right"] += 1
    else:
        s["wrong"] += 1
        stats[cid]["wrong"] += 1

    s["i"] += 1

    if s["i"] == len(QUESTIONS[s["lvl"]]):
        show_results(cid)
        del state[cid]
    else:
        ask_question(message)




def show_results(chat_id):
    s = state[chat_id]
    name = user_name.get(chat_id, "")

    text = f"Результаты — {name}\n\n"

    for i, (q, user_ans, correct_ans, explanation, ok) in enumerate(s["answers"], start=1):
        mark = "✅" if ok else "❌"
        text += (
            f"{i}. Вопрос:\n{q}\n"
            f"Ваш ответ: {user_ans} {mark}\n"
            f"Правильный ответ: {correct_ans}\n"
        )

        if not ok:
            text += f"Пояснение: {explanation}\n"

        text += "\n"

    text += (
        f"Итог за эту игру:\n"
        f"Правильных: {s['right']}\n"
        f"Неправильных: {s['wrong']}"
    )

    bot.send_message(chat_id, text)
    show_main_menu(chat_id)




def show_main_menu(chat_id):
    kb = types.ReplyKeyboardMarkup(resize_keyboard=True)
    kb.add("об игре", "начать викторину", "моя статистика")
    bot.send_message(chat_id, "Вы вернулись в главное меню.", reply_markup=kb)




bot.polling()


